[net]
batch=16
subdivisions=1
width=1088
height=608
embedding_dim=512
channels=3

# Input [bs, 3, 608, 1088]

[patch_embedding]
patch_size=4
in_channels=3
embed_dim=128
norm_layer=true

# After patch embedding [bs, 128, 152, 272]

# block*2 + down sample
[basic_layer]
dim=128
depth=2
num_heads=4
window_size=7
downsample=true
# [bs, 128, 152, 272]

[layer_norm]
features=128

# block*2 + down sample
[basic_layer]
dim=256
depth=2
num_heads=8
window_size=7
downsample=true
# [bs, 256, 76, 136]

[layer_norm]
features=256

# block*4 + down sample
[basic_layer]
dim=512
depth=18
num_heads=16
window_size=7
downsample=true
# [bs, 512, 38, 68]

[layer_norm]
features=512

# stage4 block*4 + down sample
[basic_layer]
dim=1024
depth=2
num_heads=32
window_size=7
downsample=false
# [bs, 1024, 19, 34]

[layer_norm]
features=1024

# 卷积层 过渡到Conv set
[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=leaky
# [bs, 1024, 19, 34]

######################

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

# Conv set end [bs, 512, 19, 34]

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=24
activation=linear

######### embedding ###########
[route]
layers = -3

[convolutional]
size=3
stride=1
pad=1
filters=$embedding_dim
activation=linear

[route]
layers = -3, -1
###############################


[yolo]
mask = 8,9,10,11
anchors = 10,6, 10,10, 20,20, 21,12,   40,24, 30,30, 40,40, 64,24,   100,60, 128,128, 144,144, 128,64
classes=1
num=12
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1


[route]
layers = -7

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

# concat 上采样后的和倒数第二个block

[route]
layers = -1, 3
# [bs, 384+256, 38, 68]

# Conv set 2 begin
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

# Conv set 2 end

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=24
activation=linear

######### embedding ###########
[route]
layers = -3

[convolutional]
size=3
stride=1
pad=1
filters=$embedding_dim
activation=linear

[route]
layers = -3, -1
###############################

[yolo]
mask = 4,5,6,7 
anchors = 10,6, 10,10, 20,20, 21,12,   40,24, 30,30, 40,40, 64,24,   100,60, 128,128, 144,144, 128,64
classes=1
num=12
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1



[route]
layers = -7

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

# route to block 2
[route]
layers = -1, 2

# [bs, 128+192, 76, 136]



[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=24
activation=linear



######### embedding ###########
[route]
layers = -3

[convolutional]
size=3
stride=1
pad=1
filters=$embedding_dim
activation=linear

[route]
layers = -3, -1
###############################

[yolo]
mask = 0,1,2,3
anchors = 10,6, 10,10, 20,20, 21,12,   40,24, 30,30, 40,40, 64,24,   100,60, 128,128, 144,144, 128,64
classes=1
num=12
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1
